export const questions = [
  {
    id: 1,
    title: "ช่วง 1-2 สัปดาห์นี้ คุณรู้สึกเบื่อ ทำอะไรก็ไม่ค่อยสนุกเลยใช่ไหม?",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 2,
    title: "รู้สึกเหนื่อยง่าย ล้าไปหมด ไม่มีแรงเลยหรือเปล่า?",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 3,
    title: "มีเรื่องกังวลใจ หรือกระวนกระวายใจจนหยุดคิดไม่ได้บ่อยแค่ไหน?",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 4,
    title: "รู้สึกแย่กับตัวเอง หรือคิดว่าตัวเองทำให้ครอบครัวผิดหวังบ้างไหม?",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 5,
    title: "มีปัญหาเรื่องการนอน นอนไม่หลับ หรือนอนมากเกินไปหรือเปล่า?",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 6,
    title: "รู้สึกไม่ดีกับตัวเอง คิดว่าตัวเองล้มเหลว หรือเป็นคนทำให้ตัวเอง หรือครอบครัวผิดหวัง",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 7,
    title: "สมาธิไม่ดีเวลาทำอะไร เช่น ดูโทรทัศน์ ฟังวิทยุ หรือทำงานท่ีต้องใช้ความตั้งใจ",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 8,
    title: "พูดหรือทำอะไรช้าจนคนอื่นมองเห็น หรือกระสับกระส่ายจนท่านอยู่ไม่นิ่งเหมือนเคย",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
  {
    id: 9,
    title: "คิดทำร้ายตนเอง หรือคิดว่าถ้าตาย ๆ ไปเสียคงจะดี",
    choices: [
      { id: 1, label: "แทบจะไม่มีเลย", value: 0 },
      { id: 2, label: "มีบ้างบางวัน", value: 1 },
      { id: 3, label: "เป็นบ่อยๆ (มากกว่า 3 วัน)", value: 2 },
      { id: 4, label: "เป็นแทบทุกวันเลย", value: 3 },
    ],
  },
];
